/**
 ******************************************************************************
 *  @file EMA_filter_lib.c
 *  @brief Экспоненциально взвешенное скользящее среднее/ Фильтр низких частот
 *  (англ. exponential moving average, англ. EMA Filter LOW-PASS)
 *  @author Волков Олег
 *  @date 21.11.2024
 *
 ******************************************************************************
 * @attention
 *
 *  Библиотека помогает отфильтровать данные с АЦП,
 *  приведя показания к более устойчивым.
 *  Простой и быстрый фильтр НЧ для float чисел.
 *
 *  YouTube: https://www.youtube.com/channel/UCzZKTNVpcMSALU57G1THoVw
 *  GitHub: https://github.com/Solderingironspb
 *  Группа ВК: https://vk.com/solderingiron.stm32
 *
 ******************************************************************************
 */

#include "EMA_filter_lib.h"

/**
 ******************************************************************************
 *  @breif Функция инициализации фильтра.
 *  По сути дела просто задаем фильтру коэффициет альфа и сбрасываем фильтр в 0.
 *  @param  *filter - структура данных фильтра
 *  @param  *alpha - коэфффициент альфа
 ******************************************************************************
 */
void EMA_FILTER_Init(EMA_Filter *filter, float alpha){
	EMA_FILTER_SetAlpha(filter, alpha);
	filter->out = 0.0f;
}

/**
 ******************************************************************************
 *  @breif Функция задания фильтру коэффициента альфа
 *  @param  *filter - структура данных фильтра
 *  @param  *alpha - коэфффициент альфа
 ******************************************************************************
 */
void EMA_FILTER_SetAlpha(EMA_Filter *filter, float alpha){
	if (alpha > 1.0f){
		alpha = 1.0f;
	}else if (alpha < 0.0f){
		alpha = 0.0f;
	}
	filter->alpha = alpha;
}

/**
 ******************************************************************************
 *  @breif Функция рассчета выходящих данных после фильтра
 *  @param  *filter - структура данных фильтра
 *  @param  input - входящие данные
 *  @retval  filter->out - Значение, полученное после EMA фильтра.
 ******************************************************************************
 */
float EMA_FILTER_GetValue(EMA_Filter *filter, float input){
	filter->out = filter->alpha * input + (1.0f - filter->alpha) * filter->out;
	return filter->out;
}
